src/cf/InformationRegisters/СвязиМеждуПартнерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>СвязиМеждуПартнерами</Name>
			<Comment>Не переносить в объединенные решения</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервыйПартнер</Name>
					<Comment>Первый партнер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВторойПартнер</Name>
					<Comment>Второй партнер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСвязейМеждуПартнерами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СвязиМеждуПартнерами/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Автор)
	 ИЛИ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Запись.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Параметры.Свойство("Партнер") Тогда
		Запись.ПервыйПартнер = Параметры.Партнер;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)

	Если Запись.ПервыйПартнер = Запись.ВторойПартнер Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru='Партнеры, указанные в связи не должны совпадать.'"),
		,
		"ПервыйПартнер",, Отказ);
		Отказ = Истина;
	КонецЕсли;

	// +CRM
	Если Запись.ВидСвязи = Справочники.ВидыСвязейМеждуПартнерами.CRM_Холдинг Тогда
		Если Не ЗначениеЗаполнено(Запись.ПервыйПартнер) Или Не ЗначениеЗаполнено(Запись.ПервыйПартнер) Тогда
			ТекстСообщения = НСтр("ru = 'Вид связи '")
				+ """" + Строка(Запись.ВидСвязи) + """: "
				+ НСтр("ru = 'Не выбран клиент!'");
			//
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ?(Не ЗначениеЗаполнено(Запись.ПервыйПартнер), "Запись.ПервыйПартнер", "Запись.ВторойПартнер"),, Отказ);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// -CRM
КонецПроцедуры

#КонецОбласти
